package week_1.lesson_3.hw2;

/*
 Написать калькулятор (класс hw2.ConsoleCalc) в виде консольного меню
	- сложение двух чисел
	- вычитание двух чисел
	- умножение двух чисел
	- деление двух чисел
  */

public class ConsoleCalc {
	public static void main(String[] args) {
//		start();
	}

	public static void Menu() {
		System.out.println("______________________");
		System.out.println("Choose the number of operation");
		System.out.println("");
	}
}
